export const mbtiDescriptions: { [key: string]: string } = {
  INTJ: "Strategist – Та урт хугацааны төлөвлөгөө гаргах, асуудлыг логикоор шийдэх чадвартай.",
  INTP: "Thinker – Та шинэ санаа, онол, логик анализ хийх дуртай.",
  ENTJ: "Leader – Та манлайлах, шийдвэр гаргах чадвар өндөр.",
  ENTP: "Debater – Та шинэ санаа гаргах, маргах, бүтээлч сэтгэлгээтэй.",

  INFJ: "Advocate – Та хүмүүсийг ойлгох, гүнзгий мэдрэмжтэй.",
  INFP: "Mediator – Та уран сэтгэмжтэй, үнэт зүйлдээ үнэнч.",
  ENFJ: "Protagonist – Та хүмүүсийг урамшуулах, манлайлах чадвартай.",
  ENFP: "Campaigner – Та нээлттэй, эрч хүчтэй, бүтээлч.",

  ISTJ: "Logistician – Та зохион байгуулалттай, найдвартай.",
  ISFJ: "Defender – Та халамжтай, бусдад туслах дуртай.",
  ESTJ: "Executive – Та удирдах, систем бий болгох чадвартай.",
  ESFJ: "Consul – Та хүмүүсийг холбох, хамтран ажиллах дуртай.",

  ISTP: "Virtuoso – Та практик, асуудлыг хурдан шийддэг.",
  ISFP: "Adventurer – Та чөлөөт, бүтээлч зан чанартай.",
  ESTP: "Entrepreneur – Та эрсдэлд дуртай, идэвхтэй.",
  ESFP: "Entertainer – Та нийгэмд идэвхтэй, хөгжилтэй.",
};
