export const mbtiQuestions = [
  {
    id: 1,
    question:
      "Та шинэ хүмүүстэй танилцахдаа тухайн хүний санааг анхааралтай сонсох уу?",
    options: [
      { text: "Тийм, би сонсох дуртай", type: "F" },
      { text: "Үгүй, би шууд өөрийн бодлыг илэрхийлнэ", type: "T" },
    ],
  },
  {
    id: 2,
    question:
      "Та шийдвэр гаргахдаа мэдрэмжээ дагах уу эсвэл логикоор шийдэх үү?",
    options: [
      { text: "Мэдрэмжээ дагана", type: "F" },
      { text: "Логикоор шийднэ", type: "T" },
    ],
  },
  {
    id: 3,
    question:
      "Та төлөвлөгөө гаргахдаа нарийн төлөвлөдөг үү эсвэл нөхцөл байдлаар уян хатан ажилладаг уу?",
    options: [
      { text: "Нарийн төлөвлөдөг", type: "J" },
      { text: "Уян хатан ажилладаг", type: "P" },
    ],
  },
  // Дараа нь 20-60 асуулт нэмнэ
];
